1.8.xx/package/tau_modules/app_tr069/src/sample/download.xml

<soap:Envelope 
			soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
			xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
			xmlns:cwmp="urn:dslforum-org:cwmp-1-0" 
			xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <cwmp:ID soap:mustUnderstand="1">3D8D198B69F94D7BB2A9266408481BE9</cwmp:ID>
  </soap:Header>
  <soap:Body>
    <cwmp:Download>
      	<CommandKey>keydownload</CommandKey>
	<FileType>1 Firmware Upgrade Image</FileType>
	<URL>http://192.168.0.2:10808/ta401-00.bin</URL>
	<Username></Username>
	<Password></Password>
	<FileSize>6066532</FileSize>
	<TargetFileName>ta401-00.bin</TargetFileName>
	<DelaySeconds></DelaySeconds>
	<SuccessURL>http://192.168.1.2:8080/</SuccessURL>
	<FailURL>http://192.168.1.2:8080/</FailURL>
    </cwmp:Download>
  </soap:Body>
</soap:Envelope>